internal/cli/testdata/golden/nomnom/architecture.dot
// Architecture of nomnom, generated by cloudcc.
digraph "nomnom" {
    rankdir=LR;
    node [shape=box, style=rounded, fontname="Helvetica"];
    edge [fontname="Helvetica", fontsize=10];
    aws_alb_listener_nomnom_api [label="nomnom-api\\nalb.listener", shape=box];
    aws_alb_targetgroup_nomnom_api [label="nomnom-api\\nalb.targetgroup", shape=box];
    aws_alb_nomnom_api [label="nomnom-api\\nalb", shape=ellipse];
    aws_cloudwatch_loggroup_dispatch [label="dispatch\\ncloudwatch.loggroup", shape=box];
    aws_cloudwatch_loggroup_inventory [label="inventory\\ncloudwatch.loggroup", shape=box];
    aws_cloudwatch_loggroup_notify [label="notify\\ncloudwatch.loggroup", shape=box];
    aws_cloudwatch_loggroup_pricing [label="pricing\\ncloudwatch.loggroup", shape=box];
    aws_cloudwatch_loggroup_storefront [label="storefront\\ncloudwatch.loggroup", shape=box];
    aws_cloudwatch_loggroup_tracking [label="tracking\\ncloudwatch.loggroup", shape=box];
    aws_dynamodb_assignments [label="assignments\\ndynamodb", shape=cylinder];
    aws_dynamodb_menuPrices [label="menuPrices\\ndynamodb", shape=cylinder];
    aws_dynamodb_orders [label="orders\\ndynamodb", shape=cylinder];
    aws_dynamodb_reservations [label="reservations\\ndynamodb", shape=cylinder];
    aws_dynamodb_trackingEvents [label="trackingEvents\\ndynamodb", shape=cylinder];
    aws_ecr_menu [label="menu\\necr", shape=box];
    aws_ecr_storefront [label="storefront\\necr", shape=box];
    aws_ecs_cluster_cluster [label="cluster\\necs.cluster", shape=box];
    aws_ecs_execrole_storefront_exec [label="storefront-exec\\necs.execrole", shape=box];
    aws_ecs_service_storefront [label="storefront\\necs.service", shape=box];
    aws_ecs_taskdefinition_storefront [label="storefront\\necs.taskdefinition", shape=box];
    aws_ecs_taskpolicy_storefront [label="storefront\\necs.taskpolicy", shape=box];
    aws_ecs_taskrole_storefront_task [label="storefront-task\\necs.taskrole", shape=box];
    aws_eks_cluster_kubernetes [label="kubernetes\\neks.cluster", shape=box];
    aws_eks_clusterrole_kubernetes [label="kubernetes\\neks.clusterrole", shape=box];
    aws_eks_nodegroup_kubernetes [label="kubernetes\\neks.nodegroup", shape=box];
    aws_eks_noderole_kubernetes [label="kubernetes\\neks.noderole", shape=box];
    aws_iam_policy_dispatch [label="dispatch\\niam.policy", shape=box];
    aws_iam_policy_inventory [label="inventory\\niam.policy", shape=box];
    aws_iam_policy_notify [label="notify\\niam.policy", shape=box];
    aws_iam_policy_pricing [label="pricing\\niam.policy", shape=box];
    aws_iam_policy_tracking [label="tracking\\niam.policy", shape=box];
    aws_iam_role_dispatch [label="dispatch\\niam.role", shape=box];
    aws_iam_role_inventory [label="inventory\\niam.role", shape=box];
    aws_iam_role_notify [label="notify\\niam.role", shape=box];
    aws_iam_role_pricing [label="pricing\\niam.role", shape=box];
    aws_iam_role_tracking [label="tracking\\niam.role", shape=box];
    aws_lambda_permission_dispatch_orderPlaced_sns [label="dispatch-orderPlaced-sns\\nlambda.permission", shape=box];
    aws_lambda_permission_notify_courierAssigned_sns [label="notify-courierAssigned-sns\\nlambda.permission", shape=box];
    aws_lambda_permission_notify_orderPlaced_sns [label="notify-orderPlaced-sns\\nlambda.permission", shape=box];
    aws_lambda_permission_tracking_courierAssigned_sns [label="tracking-courierAssigned-sns\\nlambda.permission", shape=box];
    aws_lambda_dispatch [label="dispatch\\nlambda", shape=box];
    aws_lambda_inventory [label="inventory\\nlambda", shape=box];
    aws_lambda_notify [label="notify\\nlambda", shape=box];
    aws_lambda_pricing [label="pricing\\nlambda", shape=box];
    aws_lambda_tracking [label="tracking\\nlambda", shape=box];
    aws_s3_notifications [label="notifications\\ns3", shape=cylinder];
    aws_sns_subscription_dispatch_orderPlaced [label="dispatch-orderPlaced\\nsns.subscription", shape=cds];
    aws_sns_subscription_notify_courierAssigned [label="notify-courierAssigned\\nsns.subscription", shape=cds];
    aws_sns_subscription_notify_orderPlaced [label="notify-orderPlaced\\nsns.subscription", shape=cds];
    aws_sns_subscription_tracking_courierAssigned [label="tracking-courierAssigned\\nsns.subscription", shape=cds];
    aws_sns_courierAssigned [label="courierAssigned\\nsns", shape=cds];
    aws_sns_orderPlaced [label="orderPlaced\\nsns", shape=cds];
    aws_vpc_gateway_network [label="network\\nvpc.gateway", shape=box];
    aws_vpc_routeassoc_network_0 [label="network-0\\nvpc.routeassoc", shape=box];
    aws_vpc_routeassoc_network_1 [label="network-1\\nvpc.routeassoc", shape=box];
    aws_vpc_routetable_network [label="network\\nvpc.routetable", shape=box];
    aws_vpc_securitygroup_network [label="network\\nvpc.securitygroup", shape=box];
    aws_vpc_subnet_network_0 [label="network-0\\nvpc.subnet", shape=box];
    aws_vpc_subnet_network_1 [label="network-1\\nvpc.subnet", shape=box];
    aws_vpc_network [label="network\\nvpc", shape=box];
    k8s_deployment_menu [label="menu\\nk8s.deployment", shape=box];
    k8s_provider_kubernetes [label="kubernetes\\nk8s.provider", shape=box];
    k8s_service_menu [label="menu\\nk8s.service", shape=box];
    aws_alb_listener_nomnom_api -> aws_alb_targetgroup_nomnom_api [label="depends_on"];
    aws_alb_listener_nomnom_api -> aws_alb_nomnom_api [label="depends_on"];
    aws_alb_targetgroup_nomnom_api -> aws_vpc_network [label="depends_on"];
    aws_alb_nomnom_api -> aws_vpc_securitygroup_network [label="depends_on"];
    aws_alb_nomnom_api -> aws_vpc_subnet_network_0 [label="depends_on"];
    aws_alb_nomnom_api -> aws_vpc_subnet_network_1 [label="depends_on"];
    aws_ecs_service_storefront -> aws_alb_listener_nomnom_api [label="depends_on"];
    aws_ecs_service_storefront -> aws_alb_targetgroup_nomnom_api [label="depends_on"];
    aws_ecs_service_storefront -> aws_ecs_cluster_cluster [label="depends_on"];
    aws_ecs_service_storefront -> aws_ecs_taskdefinition_storefront [label="depends_on"];
    aws_ecs_service_storefront -> aws_vpc_securitygroup_network [label="depends_on"];
    aws_ecs_service_storefront -> aws_vpc_subnet_network_0 [label="depends_on"];
    aws_ecs_service_storefront -> aws_vpc_subnet_network_1 [label="depends_on"];
    aws_ecs_taskdefinition_storefront -> aws_cloudwatch_loggroup_storefront [label="depends_on"];
    aws_ecs_taskdefinition_storefront -> aws_ecr_storefront [label="depends_on"];
    aws_ecs_taskdefinition_storefront -> aws_ecs_execrole_storefront_exec [label="depends_on"];
    aws_ecs_taskdefinition_storefront -> aws_ecs_taskrole_storefront_task [label="depends_on"];
    aws_ecs_taskpolicy_storefront -> aws_dynamodb_orders [label="depends_on"];
    aws_ecs_taskpolicy_storefront -> aws_ecs_taskrole_storefront_task [label="depends_on"];
    aws_ecs_taskpolicy_storefront -> aws_lambda_inventory [label="depends_on"];
    aws_ecs_taskpolicy_storefront -> aws_lambda_pricing [label="depends_on"];
    aws_ecs_taskpolicy_storefront -> aws_lambda_tracking [label="depends_on"];
    aws_ecs_taskpolicy_storefront -> aws_sns_orderPlaced [label="depends_on"];
    aws_eks_cluster_kubernetes -> aws_eks_clusterrole_kubernetes [label="depends_on"];
    aws_eks_cluster_kubernetes -> aws_vpc_subnet_network_0 [label="depends_on"];
    aws_eks_cluster_kubernetes -> aws_vpc_subnet_network_1 [label="depends_on"];
    aws_eks_nodegroup_kubernetes -> aws_eks_cluster_kubernetes [label="depends_on"];
    aws_eks_nodegroup_kubernetes -> aws_eks_noderole_kubernetes [label="depends_on"];
    aws_eks_nodegroup_kubernetes -> aws_vpc_subnet_network_0 [label="depends_on"];
    aws_eks_nodegroup_kubernetes -> aws_vpc_subnet_network_1 [label="depends_on"];
    aws_iam_policy_dispatch -> aws_dynamodb_assignments [label="depends_on"];
    aws_iam_policy_dispatch -> aws_iam_role_dispatch [label="depends_on"];
    aws_iam_policy_dispatch -> aws_lambda_inventory [label="depends_on"];
    aws_iam_policy_dispatch -> aws_sns_courierAssigned [label="depends_on"];
    aws_iam_policy_inventory -> aws_dynamodb_reservations [label="depends_on"];
    aws_iam_policy_inventory -> aws_iam_role_inventory [label="depends_on"];
    aws_iam_policy_notify -> aws_iam_role_notify [label="depends_on"];
    aws_iam_policy_notify -> aws_s3_notifications [label="depends_on"];
    aws_iam_policy_pricing -> aws_dynamodb_menuPrices [label="depends_on"];
    aws_iam_policy_pricing -> aws_iam_role_pricing [label="depends_on"];
    aws_iam_policy_tracking -> aws_dynamodb_trackingEvents [label="depends_on"];
    aws_iam_policy_tracking -> aws_iam_role_tracking [label="depends_on"];
    aws_lambda_permission_dispatch_orderPlaced_sns -> aws_lambda_dispatch [label="depends_on"];
    aws_lambda_permission_dispatch_orderPlaced_sns -> aws_sns_orderPlaced [label="depends_on"];
    aws_lambda_permission_notify_courierAssigned_sns -> aws_lambda_notify [label="depends_on"];
    aws_lambda_permission_notify_courierAssigned_sns -> aws_sns_courierAssigned [label="depends_on"];
    aws_lambda_permission_notify_orderPlaced_sns -> aws_lambda_notify [label="depends_on"];
    aws_lambda_permission_notify_orderPlaced_sns -> aws_sns_orderPlaced [label="depends_on"];
    aws_lambda_permission_tracking_courierAssigned_sns -> aws_lambda_tracking [label="depends_on"];
    aws_lambda_permission_tracking_courierAssigned_sns -> aws_sns_courierAssigned [label="depends_on"];
    aws_lambda_dispatch -> aws_cloudwatch_loggroup_dispatch [label="depends_on"];
    aws_lambda_dispatch -> aws_iam_role_dispatch [label="depends_on"];
    aws_lambda_inventory -> aws_cloudwatch_loggroup_inventory [label="depends_on"];
    aws_lambda_inventory -> aws_iam_role_inventory [label="depends_on"];
    aws_lambda_notify -> aws_cloudwatch_loggroup_notify [label="depends_on"];
    aws_lambda_notify -> aws_iam_role_notify [label="depends_on"];
    aws_lambda_pricing -> aws_cloudwatch_loggroup_pricing [label="depends_on"];
    aws_lambda_pricing -> aws_iam_role_pricing [label="depends_on"];
    aws_lambda_tracking -> aws_cloudwatch_loggroup_tracking [label="depends_on"];
    aws_lambda_tracking -> aws_iam_role_tracking [label="depends_on"];
    aws_sns_subscription_dispatch_orderPlaced -> aws_lambda_dispatch [label="depends_on"];
    aws_sns_subscription_dispatch_orderPlaced -> aws_sns_orderPlaced [label="depends_on"];
    aws_sns_subscription_notify_courierAssigned -> aws_lambda_notify [label="depends_on"];
    aws_sns_subscription_notify_courierAssigned -> aws_sns_courierAssigned [label="depends_on"];
    aws_sns_subscription_notify_orderPlaced -> aws_lambda_notify [label="depends_on"];
    aws_sns_subscription_notify_orderPlaced -> aws_sns_orderPlaced [label="depends_on"];
    aws_sns_subscription_tracking_courierAssigned -> aws_lambda_tracking [label="depends_on"];
    aws_sns_subscription_tracking_courierAssigned -> aws_sns_courierAssigned [label="depends_on"];
    aws_vpc_gateway_network -> aws_vpc_network [label="depends_on"];
    aws_vpc_routeassoc_network_0 -> aws_vpc_routetable_network [label="depends_on"];
    aws_vpc_routeassoc_network_0 -> aws_vpc_subnet_network_0 [label="depends_on"];
    aws_vpc_routeassoc_network_1 -> aws_vpc_routetable_network [label="depends_on"];
    aws_vpc_routeassoc_network_1 -> aws_vpc_subnet_network_1 [label="depends_on"];
    aws_vpc_routetable_network -> aws_vpc_gateway_network [label="depends_on"];
    aws_vpc_routetable_network -> aws_vpc_network [label="depends_on"];
    aws_vpc_securitygroup_network -> aws_vpc_network [label="depends_on"];
    aws_vpc_subnet_network_0 -> aws_vpc_network [label="depends_on"];
    aws_vpc_subnet_network_1 -> aws_vpc_network [label="depends_on"];
    k8s_deployment_menu -> aws_ecr_menu [label="depends_on"];
    k8s_deployment_menu -> k8s_provider_kubernetes [label="depends_on"];
    k8s_provider_kubernetes -> aws_eks_cluster_kubernetes [label="depends_on"];
    k8s_provider_kubernetes -> aws_eks_nodegroup_kubernetes [label="depends_on"];
    k8s_service_menu -> k8s_deployment_menu [label="depends_on"];
    aws_ecs_service_storefront -> aws_cloudwatch_loggroup_inventory [label="uses"];
    aws_ecs_service_storefront -> aws_cloudwatch_loggroup_pricing [label="uses"];
    aws_ecs_service_storefront -> aws_cloudwatch_loggroup_tracking [label="uses"];
    aws_ecs_service_storefront -> aws_dynamodb_orders [label="uses"];
    aws_ecs_service_storefront -> aws_iam_policy_inventory [label="uses"];
    aws_ecs_service_storefront -> aws_iam_policy_pricing [label="uses"];
    aws_ecs_service_storefront -> aws_iam_policy_tracking [label="uses"];
    aws_ecs_service_storefront -> aws_iam_role_inventory [label="uses"];
    aws_ecs_service_storefront -> aws_iam_role_pricing [label="uses"];
    aws_ecs_service_storefront -> aws_iam_role_tracking [label="uses"];
    aws_ecs_service_storefront -> aws_lambda_inventory [label="uses"];
    aws_ecs_service_storefront -> aws_lambda_pricing [label="uses"];
    aws_ecs_service_storefront -> aws_lambda_tracking [label="uses"];
    aws_ecs_service_storefront -> aws_sns_courierAssigned [label="uses"];
    aws_ecs_service_storefront -> aws_sns_orderPlaced [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_cloudwatch_loggroup_inventory [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_cloudwatch_loggroup_pricing [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_cloudwatch_loggroup_tracking [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_dynamodb_orders [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_iam_policy_inventory [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_iam_policy_pricing [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_iam_policy_tracking [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_iam_role_inventory [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_iam_role_pricing [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_iam_role_tracking [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_lambda_inventory [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_lambda_pricing [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_lambda_tracking [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_sns_courierAssigned [label="uses"];
    aws_ecs_taskdefinition_storefront -> aws_sns_orderPlaced [label="uses"];
    aws_lambda_dispatch -> aws_cloudwatch_loggroup_inventory [label="uses"];
    aws_lambda_dispatch -> aws_dynamodb_assignments [label="uses"];
    aws_lambda_dispatch -> aws_iam_policy_inventory [label="uses"];
    aws_lambda_dispatch -> aws_iam_role_inventory [label="uses"];
    aws_lambda_dispatch -> aws_lambda_inventory [label="uses"];
    aws_lambda_dispatch -> aws_sns_courierAssigned [label="uses"];
    aws_lambda_dispatch -> aws_sns_orderPlaced [label="uses"];
    aws_lambda_inventory -> aws_dynamodb_reservations [label="uses"];
    aws_lambda_notify -> aws_s3_notifications [label="uses"];
    aws_lambda_notify -> aws_sns_courierAssigned [label="uses"];
    aws_lambda_notify -> aws_sns_orderPlaced [label="uses"];
    aws_lambda_pricing -> aws_dynamodb_menuPrices [label="uses"];
    aws_lambda_tracking -> aws_dynamodb_trackingEvents [label="uses"];
    aws_lambda_tracking -> aws_sns_courierAssigned [label="uses"];
    aws_lambda_tracking -> aws_sns_orderPlaced [label="uses"];
}
