internal/cli/testdata/golden/nomnom/architecture.mmd
%% Architecture of nomnom, generated by cloudcc.
flowchart LR
    aws_alb_listener_nomnom_api["nomnom-api\nalb.listener"]
    aws_alb_targetgroup_nomnom_api["nomnom-api\nalb.targetgroup"]
    aws_alb_nomnom_api(["nomnom-api\nalb"])
    aws_cloudwatch_loggroup_dispatch["dispatch\ncloudwatch.loggroup"]
    aws_cloudwatch_loggroup_inventory["inventory\ncloudwatch.loggroup"]
    aws_cloudwatch_loggroup_notify["notify\ncloudwatch.loggroup"]
    aws_cloudwatch_loggroup_pricing["pricing\ncloudwatch.loggroup"]
    aws_cloudwatch_loggroup_storefront["storefront\ncloudwatch.loggroup"]
    aws_cloudwatch_loggroup_tracking["tracking\ncloudwatch.loggroup"]
    aws_dynamodb_assignments[("assignments\ndynamodb")]
    aws_dynamodb_menuPrices[("menuPrices\ndynamodb")]
    aws_dynamodb_orders[("orders\ndynamodb")]
    aws_dynamodb_reservations[("reservations\ndynamodb")]
    aws_dynamodb_trackingEvents[("trackingEvents\ndynamodb")]
    aws_ecr_menu["menu\necr"]
    aws_ecr_storefront["storefront\necr"]
    aws_ecs_cluster_cluster["cluster\necs.cluster"]
    aws_ecs_execrole_storefront_exec["storefront-exec\necs.execrole"]
    aws_ecs_service_storefront["storefront\necs.service"]
    aws_ecs_taskdefinition_storefront["storefront\necs.taskdefinition"]
    aws_ecs_taskpolicy_storefront["storefront\necs.taskpolicy"]
    aws_ecs_taskrole_storefront_task["storefront-task\necs.taskrole"]
    aws_eks_cluster_kubernetes["kubernetes\neks.cluster"]
    aws_eks_clusterrole_kubernetes["kubernetes\neks.clusterrole"]
    aws_eks_nodegroup_kubernetes["kubernetes\neks.nodegroup"]
    aws_eks_noderole_kubernetes["kubernetes\neks.noderole"]
    aws_iam_policy_dispatch["dispatch\niam.policy"]
    aws_iam_policy_inventory["inventory\niam.policy"]
    aws_iam_policy_notify["notify\niam.policy"]
    aws_iam_policy_pricing["pricing\niam.policy"]
    aws_iam_policy_tracking["tracking\niam.policy"]
    aws_iam_role_dispatch["dispatch\niam.role"]
    aws_iam_role_inventory["inventory\niam.role"]
    aws_iam_role_notify["notify\niam.role"]
    aws_iam_role_pricing["pricing\niam.role"]
    aws_iam_role_tracking["tracking\niam.role"]
    aws_lambda_permission_dispatch_orderPlaced_sns["dispatch-orderPlaced-sns\nlambda.permission"]
    aws_lambda_permission_notify_courierAssigned_sns["notify-courierAssigned-sns\nlambda.permission"]
    aws_lambda_permission_notify_orderPlaced_sns["notify-orderPlaced-sns\nlambda.permission"]
    aws_lambda_permission_tracking_courierAssigned_sns["tracking-courierAssigned-sns\nlambda.permission"]
    aws_lambda_dispatch["dispatch\nlambda"]
    aws_lambda_inventory["inventory\nlambda"]
    aws_lambda_notify["notify\nlambda"]
    aws_lambda_pricing["pricing\nlambda"]
    aws_lambda_tracking["tracking\nlambda"]
    aws_s3_notifications[("notifications\ns3")]
    aws_sns_subscription_dispatch_orderPlaced>"dispatch-orderPlaced\nsns.subscription"]
    aws_sns_subscription_notify_courierAssigned>"notify-courierAssigned\nsns.subscription"]
    aws_sns_subscription_notify_orderPlaced>"notify-orderPlaced\nsns.subscription"]
    aws_sns_subscription_tracking_courierAssigned>"tracking-courierAssigned\nsns.subscription"]
    aws_sns_courierAssigned>"courierAssigned\nsns"]
    aws_sns_orderPlaced>"orderPlaced\nsns"]
    aws_vpc_gateway_network["network\nvpc.gateway"]
    aws_vpc_routeassoc_network_0["network-0\nvpc.routeassoc"]
    aws_vpc_routeassoc_network_1["network-1\nvpc.routeassoc"]
    aws_vpc_routetable_network["network\nvpc.routetable"]
    aws_vpc_securitygroup_network["network\nvpc.securitygroup"]
    aws_vpc_subnet_network_0["network-0\nvpc.subnet"]
    aws_vpc_subnet_network_1["network-1\nvpc.subnet"]
    aws_vpc_network["network\nvpc"]
    k8s_deployment_menu["menu\nk8s.deployment"]
    k8s_provider_kubernetes["kubernetes\nk8s.provider"]
    k8s_service_menu["menu\nk8s.service"]
    aws_alb_listener_nomnom_api --> aws_alb_targetgroup_nomnom_api
    aws_alb_listener_nomnom_api --> aws_alb_nomnom_api
    aws_alb_targetgroup_nomnom_api --> aws_vpc_network
    aws_alb_nomnom_api --> aws_vpc_securitygroup_network
    aws_alb_nomnom_api --> aws_vpc_subnet_network_0
    aws_alb_nomnom_api --> aws_vpc_subnet_network_1
    aws_ecs_service_storefront --> aws_alb_listener_nomnom_api
    aws_ecs_service_storefront --> aws_alb_targetgroup_nomnom_api
    aws_ecs_service_storefront --> aws_ecs_cluster_cluster
    aws_ecs_service_storefront --> aws_ecs_taskdefinition_storefront
    aws_ecs_service_storefront --> aws_vpc_securitygroup_network
    aws_ecs_service_storefront --> aws_vpc_subnet_network_0
    aws_ecs_service_storefront --> aws_vpc_subnet_network_1
    aws_ecs_taskdefinition_storefront --> aws_cloudwatch_loggroup_storefront
    aws_ecs_taskdefinition_storefront --> aws_ecr_storefront
    aws_ecs_taskdefinition_storefront --> aws_ecs_execrole_storefront_exec
    aws_ecs_taskdefinition_storefront --> aws_ecs_taskrole_storefront_task
    aws_ecs_taskpolicy_storefront --> aws_dynamodb_orders
    aws_ecs_taskpolicy_storefront --> aws_ecs_taskrole_storefront_task
    aws_ecs_taskpolicy_storefront --> aws_lambda_inventory
    aws_ecs_taskpolicy_storefront --> aws_lambda_pricing
    aws_ecs_taskpolicy_storefront --> aws_lambda_tracking
    aws_ecs_taskpolicy_storefront --> aws_sns_orderPlaced
    aws_eks_cluster_kubernetes --> aws_eks_clusterrole_kubernetes
    aws_eks_cluster_kubernetes --> aws_vpc_subnet_network_0
    aws_eks_cluster_kubernetes --> aws_vpc_subnet_network_1
    aws_eks_nodegroup_kubernetes --> aws_eks_cluster_kubernetes
    aws_eks_nodegroup_kubernetes --> aws_eks_noderole_kubernetes
    aws_eks_nodegroup_kubernetes --> aws_vpc_subnet_network_0
    aws_eks_nodegroup_kubernetes --> aws_vpc_subnet_network_1
    aws_iam_policy_dispatch --> aws_dynamodb_assignments
    aws_iam_policy_dispatch --> aws_iam_role_dispatch
    aws_iam_policy_dispatch --> aws_lambda_inventory
    aws_iam_policy_dispatch --> aws_sns_courierAssigned
    aws_iam_policy_inventory --> aws_dynamodb_reservations
    aws_iam_policy_inventory --> aws_iam_role_inventory
    aws_iam_policy_notify --> aws_iam_role_notify
    aws_iam_policy_notify --> aws_s3_notifications
    aws_iam_policy_pricing --> aws_dynamodb_menuPrices
    aws_iam_policy_pricing --> aws_iam_role_pricing
    aws_iam_policy_tracking --> aws_dynamodb_trackingEvents
    aws_iam_policy_tracking --> aws_iam_role_tracking
    aws_lambda_permission_dispatch_orderPlaced_sns --> aws_lambda_dispatch
    aws_lambda_permission_dispatch_orderPlaced_sns --> aws_sns_orderPlaced
    aws_lambda_permission_notify_courierAssigned_sns --> aws_lambda_notify
    aws_lambda_permission_notify_courierAssigned_sns --> aws_sns_courierAssigned
    aws_lambda_permission_notify_orderPlaced_sns --> aws_lambda_notify
    aws_lambda_permission_notify_orderPlaced_sns --> aws_sns_orderPlaced
    aws_lambda_permission_tracking_courierAssigned_sns --> aws_lambda_tracking
    aws_lambda_permission_tracking_courierAssigned_sns --> aws_sns_courierAssigned
    aws_lambda_dispatch --> aws_cloudwatch_loggroup_dispatch
    aws_lambda_dispatch --> aws_iam_role_dispatch
    aws_lambda_inventory --> aws_cloudwatch_loggroup_inventory
    aws_lambda_inventory --> aws_iam_role_inventory
    aws_lambda_notify --> aws_cloudwatch_loggroup_notify
    aws_lambda_notify --> aws_iam_role_notify
    aws_lambda_pricing --> aws_cloudwatch_loggroup_pricing
    aws_lambda_pricing --> aws_iam_role_pricing
    aws_lambda_tracking --> aws_cloudwatch_loggroup_tracking
    aws_lambda_tracking --> aws_iam_role_tracking
    aws_sns_subscription_dispatch_orderPlaced --> aws_lambda_dispatch
    aws_sns_subscription_dispatch_orderPlaced --> aws_sns_orderPlaced
    aws_sns_subscription_notify_courierAssigned --> aws_lambda_notify
    aws_sns_subscription_notify_courierAssigned --> aws_sns_courierAssigned
    aws_sns_subscription_notify_orderPlaced --> aws_lambda_notify
    aws_sns_subscription_notify_orderPlaced --> aws_sns_orderPlaced
    aws_sns_subscription_tracking_courierAssigned --> aws_lambda_tracking
    aws_sns_subscription_tracking_courierAssigned --> aws_sns_courierAssigned
    aws_vpc_gateway_network --> aws_vpc_network
    aws_vpc_routeassoc_network_0 --> aws_vpc_routetable_network
    aws_vpc_routeassoc_network_0 --> aws_vpc_subnet_network_0
    aws_vpc_routeassoc_network_1 --> aws_vpc_routetable_network
    aws_vpc_routeassoc_network_1 --> aws_vpc_subnet_network_1
    aws_vpc_routetable_network --> aws_vpc_gateway_network
    aws_vpc_routetable_network --> aws_vpc_network
    aws_vpc_securitygroup_network --> aws_vpc_network
    aws_vpc_subnet_network_0 --> aws_vpc_network
    aws_vpc_subnet_network_1 --> aws_vpc_network
    k8s_deployment_menu --> aws_ecr_menu
    k8s_deployment_menu --> k8s_provider_kubernetes
    k8s_provider_kubernetes --> aws_eks_cluster_kubernetes
    k8s_provider_kubernetes --> aws_eks_nodegroup_kubernetes
    k8s_service_menu --> k8s_deployment_menu
    aws_ecs_service_storefront -->|uses| aws_cloudwatch_loggroup_inventory
    aws_ecs_service_storefront -->|uses| aws_cloudwatch_loggroup_pricing
    aws_ecs_service_storefront -->|uses| aws_cloudwatch_loggroup_tracking
    aws_ecs_service_storefront -->|uses| aws_dynamodb_orders
    aws_ecs_service_storefront -->|uses| aws_iam_policy_inventory
    aws_ecs_service_storefront -->|uses| aws_iam_policy_pricing
    aws_ecs_service_storefront -->|uses| aws_iam_policy_tracking
    aws_ecs_service_storefront -->|uses| aws_iam_role_inventory
    aws_ecs_service_storefront -->|uses| aws_iam_role_pricing
    aws_ecs_service_storefront -->|uses| aws_iam_role_tracking
    aws_ecs_service_storefront -->|uses| aws_lambda_inventory
    aws_ecs_service_storefront -->|uses| aws_lambda_pricing
    aws_ecs_service_storefront -->|uses| aws_lambda_tracking
    aws_ecs_service_storefront -->|uses| aws_sns_courierAssigned
    aws_ecs_service_storefront -->|uses| aws_sns_orderPlaced
    aws_ecs_taskdefinition_storefront -->|uses| aws_cloudwatch_loggroup_inventory
    aws_ecs_taskdefinition_storefront -->|uses| aws_cloudwatch_loggroup_pricing
    aws_ecs_taskdefinition_storefront -->|uses| aws_cloudwatch_loggroup_tracking
    aws_ecs_taskdefinition_storefront -->|uses| aws_dynamodb_orders
    aws_ecs_taskdefinition_storefront -->|uses| aws_iam_policy_inventory
    aws_ecs_taskdefinition_storefront -->|uses| aws_iam_policy_pricing
    aws_ecs_taskdefinition_storefront -->|uses| aws_iam_policy_tracking
    aws_ecs_taskdefinition_storefront -->|uses| aws_iam_role_inventory
    aws_ecs_taskdefinition_storefront -->|uses| aws_iam_role_pricing
    aws_ecs_taskdefinition_storefront -->|uses| aws_iam_role_tracking
    aws_ecs_taskdefinition_storefront -->|uses| aws_lambda_inventory
    aws_ecs_taskdefinition_storefront -->|uses| aws_lambda_pricing
    aws_ecs_taskdefinition_storefront -->|uses| aws_lambda_tracking
    aws_ecs_taskdefinition_storefront -->|uses| aws_sns_courierAssigned
    aws_ecs_taskdefinition_storefront -->|uses| aws_sns_orderPlaced
    aws_lambda_dispatch -->|uses| aws_cloudwatch_loggroup_inventory
    aws_lambda_dispatch -->|uses| aws_dynamodb_assignments
    aws_lambda_dispatch -->|uses| aws_iam_policy_inventory
    aws_lambda_dispatch -->|uses| aws_iam_role_inventory
    aws_lambda_dispatch -->|uses| aws_lambda_inventory
    aws_lambda_dispatch -->|uses| aws_sns_courierAssigned
    aws_lambda_dispatch -->|uses| aws_sns_orderPlaced
    aws_lambda_inventory -->|uses| aws_dynamodb_reservations
    aws_lambda_notify -->|uses| aws_s3_notifications
    aws_lambda_notify -->|uses| aws_sns_courierAssigned
    aws_lambda_notify -->|uses| aws_sns_orderPlaced
    aws_lambda_pricing -->|uses| aws_dynamodb_menuPrices
    aws_lambda_tracking -->|uses| aws_dynamodb_trackingEvents
    aws_lambda_tracking -->|uses| aws_sns_courierAssigned
    aws_lambda_tracking -->|uses| aws_sns_orderPlaced
